# Напишите программу, в которой пользователь будет задавать две строки, 
# программа - определять кол-во вхождений одной строки в  другой.

a = str(input("Input first string: "))
b = str(input("Input second string: "))
print(a.count(b))