# Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

for i in range(int(input("Input your number: "))):
    print((-3) ** i, end = " ")
